package main

import (
	"fmt"
	"transliterate/transliterator"
)

func main() {
	customDictionary := make(map[string]map[rune]string)
	customDictionary["ru"] = map[rune]string{
		0x410: "A",    // А
		0x430: "a",    // а
		0x411: "B",    // Б
		0x431: "b",    // б
		0x412: "V",    // В
		0x432: "v",    // в
		0x413: "G",    // Г
		0x433: "g",    // г
		0x414: "D",    // Д
		0x434: "d",    // д
		0x415: "E",    // Е
		0x435: "e",    // е
		0x401: "YE",   // Ё
		0x451: "ye",   // ё
		0x416: "ZH",   // Ж
		0x436: "zh",   // ж
		0x417: "Z",    // З
		0x437: "z",    // з
		0x418: "I",    // И
		0x438: "i",    // и
		0x419: "Y",    // Й
		0x439: "y",    // й
		0x41A: "K",    // К
		0x43A: "k",    // к
		0x41B: "L",    // Л
		0x43B: "l",    // л
		0x41C: "M",    // М
		0x43C: "m",    // м
		0x41D: "N",    // Н
		0x43D: "n",    // н
		0x41E: "O",    // О
		0x43E: "o",    // о
		0x41F: "P",    // П
		0x43F: "p",    // п
		0x420: "R",    // Р
		0x440: "r",    // р
		0x421: "S",    // С
		0x441: "s",    // с
		0x422: "T",    // Т
		0x442: "t",    // т
		0x423: "U",    // У
		0x443: "u",    // у
		0x424: "F",    // Ф
		0x444: "f",    // ф
		0x425: "Kh",   // Х
		0x445: "kh",   // х
		0x426: "TS",   // Ц
		0x446: "ts",   // ц
		0x427: "Ch",   // Ч
		0x447: "ch",   // ч
		0x428: "SH",   // Ш
		0x448: "sh",   // ш
		0x429: "SHCH", // Щ
		0x449: "shh",  // щ
		0x42A: "",     // Ъ
		0x44A: "",     // ъ
		0x42B: "Y",    // Ы
		0x44B: "y",    // ы
		0x42C: "",     // Ь
		0x44C: "",     // ь
		0x42D: "EH",   // Э
		0x44D: "eh",   // э
		0x42E: "YU",   // Ю
		0x44E: "yu",   // ю
		0x42F: "YA",   // Я
		0x44F: "ya",   // я
	}
	customDictionary["eu"] = map[rune]string{}

	str1 := "ivanov"
	str2 := "иванов"

	trans := transliterator.NewTransliterator(&customDictionary)
	fmt.Println(trans.Transliterate(str1, "eu"))
	fmt.Println(trans.Transliterate(str2, "ru"))

}

//А: 0410
//а: 0430
//Б: 0411
//б: 0431
//В: 0412
//в: 0432
//Г: 0413
//г: 0433
//Д: 0414
//д: 0434
//Е: 0415
//е: 0435
//Ё: 0401
//ё: 0451
//Ж: 0416
//ж: 0436
//З: 0417
//з: 0437
//И: 0418
//и: 0438
//Й: 0419
//й: 0439
//К: 041A
//к: 043A
//Л: 041B
//л: 043B
//М: 041C
//м: 043C
//Н: 041D
//н: 043D
//О: 041E
//о: 043E
//П: 041F
//п: 043F
//Р: 0420
//р: 0440
//С: 0421
//с: 0441
//Т: 0422
//т: 0442
//У: 0423
//у: 0443
//Ф: 0424
//ф: 0444
//Х: 0425
//х: 0445
//Ц: 0426
//ц: 0446
//Ч: 0427
//ч: 0447
//Ш: 0428
//ш: 0448
//Щ: 0429
//щ: 0449
//Ъ: 042A
//ъ: 044A
//Ы: 042B
//ы: 044B
//Ь: 042C
//ь: 044C
//Э: 042D
//э: 044D
//Ю: 042E
//ю: 044E
//Я: 042F
//я: 044F
